OpenFoam/validation9rod/CHT/constant/fluid/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/fluid/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    LeftWedge
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          4000;
        startFace       7860;
    }
    RightWedge
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          4000;
        startFace       11860;
    }
    Inlet
    {
        type            patch;
        nFaces          40;
        startFace       15860;
    }
    Outlet
    {
        type            patch;
        nFaces          40;
        startFace       15900;
    }
    Outterwall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       15940;
    }
    fluid_to_solid
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          100;
        startFace       16040;
        sampleMode      nearestPatchFace;
        sampleRegion    solid;
        samplePatch     solid_to_fluid;
    }
)

// ************************************************************************* //
