OpenFoam/validation9rod/CHT/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(   

    // Center Cylinder (R = 3.175 mm)
    (0 0 -876)                                //0
    (2.93331751572 -1.21501989776 -876)       //1  
    (2.93331751572  1.21501989776 -876)       //2 
    (0 0 0)                                   //3   
    (2.93331751572 -1.21501989776  0 )        //4
    (2.93331751572  1.21501989776  0 )        //5

    // Center Cylinder Boundary Layer ( d = 6 mm )
    (7.39103626009 -3.06146745892 -876)       //6  
    (7.39103626009  3.06146745892 -876)       //7
    (7.39103626009 -3.06146745892  0)         //8 
    (7.39103626009  3.06146745892  0)         //9

    // Outter cylinder Boundary Layer ( d = 6 mm )
    (32.3357836379 -13.3939201328 -876)       //10  
    (32.3357836379  13.3939201328 -876)       //11
    (32.3357836379 -13.3939201328  0)         //12 
    (32.3357836379  13.3939201328  0)         //13

    // Outter Cylinder (R = 41.25 mm)
    (38.1100307161 -15.785691585 -876)       //14  
    (38.1100307161  15.785691585 -876)       //15
    (38.1100307161 -15.785691585  0)         //16 
    (38.1100307161  15.785691585  0)         //17

    // Top Cylinder (R = 3.175 mm)
    (15.1359183811  -6.26950267244 -876)       //18
    (18.0692358969  -7.4845225702  -876)       //19
    (19.2842557947  -4.55120505448 -876)       //20
    (21.0025534126  -8.69954246796 -876)       //21
    (15.1359183811  -6.26950267244 0)          //22
    (18.0692358969  -7.4845225702  0)          //23
    (19.2842557947  -4.55120505448 0)          //24
    (21.0025534126  -8.69954246796 0)          //25   


 
   // 21.0025534126 18.0692358969 15.1359183811
   // 8.69954246796 7.4845225702 6.26950267244

   // 4.55120505448 19.2842557947
); 
 
blocks
(   

    hex ( 0  1  2  0  3  4  5  3) ( 4  9 100) simpleGrading ( 1 1 1) // Center cil
    hex ( 1  6  7  2  4  8  9  5) (15  9 100) simpleGrading (12 1 1) // Boundary layer center cil
    //hex ( 6 10 11  7  8 12 13  9) (10 9 100) simpleGrading ( 1 1 1) // Main MEsh
    hex (10 14 15 11 12 16 17 13) (15  9 100) simpleGrading (0.08 1 1) // Boundary laye outter cil
    hex (19 20 18 19 23 24 22 23) ( 4  9 100) simpleGrading ( 1 1 1) // 1/2 vert cil
    //hex (19 21 20 19 23 25 24 23) ( 4  9 100) simpleGrading ( 1 1 1) // 1/2 vert cil
);
 
edges
(
    arc  1  2 (3.175  0 -876)
    arc  4  5 (3.175  0    0)
    arc  6  7 (8      0 -876)
    arc  8  9 (8      0    0)
    arc 10 11 (35     0 -876)
    arc 12 13 (35     0    0)
    arc 14 15 (41.25  0 -876)
    arc 16 17 (41.25  0    0)
    arc 18 20 (18.0692358969 -4.3095225702 -876)
    arc 22 24 (18.0692358969 -4.3095225702    0)
    arc 20 21 (21.2442358969 -7.4845225702 -876)
    arc 24 25 (21.2442358969 -7.4845225702 -876)
);
 
boundary
(
    /*
    CHTLeftWedge  {     type wedge; faces ((0 1 2 3));}
    CHTRightWedge {     type wedge; faces ((0 4 5 3));}
    
    LeftWedge     {     type wedge; faces ((1 6 8 2));}
    RightWedge    {     type wedge; faces ((4 5 9 7));}

    Inlet   {           type patch; faces ((1 4 7 6));}
    Outlet  {           type patch; faces ((2 8 9 5));}

    axis    {           type empty; faces ((0 3 3 0));}

    Outterwall    {     type wall;  faces ((6 7 9 8));}
*/);
 
mergePatchPairs();