OpenFoam/validation9rod/CHT/system/fluid/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default                                   none;
    div(phi,U)                                bounded Gauss upwind;
    div(phi,K)                                bounded Gauss upwind;
    div(phi,h)                                bounded Gauss upwind;
    div(phi,k)                                bounded Gauss upwind;
    div(phi,epsilon)                          bounded Gauss upwind;
    div(((rho*nuEff)*dev2(T(grad(U)))))       Gauss linear;
    div(Ji,Ii_h)                              bounded Gauss linearUpwind grad(Ii_h);  
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}


// ************************************************************************* //
