OpenFoam/validation9rod/CHT/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    // solid
    {
        name    solid;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (0 -1 -1.5)(0.0032 1 0);
        }
    }
    {
        name    solid;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set solid;
        }
    }

    // fluid
    {
        name    fluid;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (0.0032 -1 -1.5)(1 1 0);
        }
    }
    {
        name    fluid;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set fluid;
        }
    }

);

// ************************************************************************* //
